### **Pandas Harika Özellikleri-2**
# **loc / iloc / concat / aggregate**

Pandas'ı import edelim

In [1]:
import pandas as pd

Bir sözlük oluşturalım

In [34]:
calisan={'isim':['ali','veli','erhan','enes','mehmet'],
     'yas':[44,23,35,36,41],
     'meslek':['mühendis','mühendis','muhasebe','müdür','insan kaynakları'],
     'ücret':[4500,5500,8000,15000,9000]}

Sözlükten DataFrame'e dönüştürelim

In [35]:
veri=pd.DataFrame(calisan)
veri

     isim  yas            meslek  ücret
0     ali   44          mühendis   4500
1    veli   23          mühendis   5500
2   erhan   35          muhasebe   8000
3    enes   36             müdür  15000
4  mehmet   41  insan kaynakları   9000

İndeksi güncelleme

In [39]:
veri.index=['a','b','c','d','e']

## **loc metodu**

In [46]:
veri.loc["d"]

isim       enes
yas          36
meslek    müdür
ücret     15000
Name: d, dtype: object

In [45]:
veri.loc['a':'d']

    isim  yas    meslek  ücret
a    ali   44  mühendis   4500
b   veli   23  mühendis   5500
c  erhan   35  muhasebe   8000
d   enes   36     müdür  15000

Şartlı İfadelerin loc içerisinde kullanılması

In [48]:
veri.loc[veri.ücret>5000 ,['isim','meslek']] # Maaşı 5000den fazla çalışanlar

     isim            meslek
b    veli          mühendis
c   erhan          muhasebe
d    enes             müdür
e  mehmet  insan kaynakları

## **iloc**

Verimizin kendi indexinden bağımsız olarak **iloc** ile 0'dan başlayarak indisleme ile erişebiliriz.

In [54]:
veri.iloc[4]

isim                mehmet
yas                     41
meslek    insan kaynakları
ücret                 9000
Name: e, dtype: object

In [52]:
veri.iloc[0:2] # index isimlerinden bağımsız indise erişme

   isim  yas    meslek  ücret
a   ali   44  mühendis   4500
b  veli   23  mühendis   5500

## İki veri Setini Birleştirme **concat**

Yeni bir veri seti oluşturalım

In [64]:
personel2={'isim':['musa','kazım','nihat','bahri','selim'],
     'yas':[23,46,19,51,27],
     'meslek':['satış','mühendis','satış','müdür','müdür'],
     'ücret':[4500,5500,8000,9000,15000]}
veri2=pd.DataFrame(personel2)

**concat** ile indexlerini de resetleyerek iki verimizi birleştirelim

In [65]:
tum_calisan=pd.concat([veri,veri2],ignore_index=True)
tum_calisan

     isim  yas            meslek  ücret
0     ali   44          mühendis   4500
1    veli   23          mühendis   5500
2   erhan   35          muhasebe   8000
3    enes   36             müdür  15000
4  mehmet   41  insan kaynakları   9000
5    musa   23             satış   4500
6   kazım   46          mühendis   5500
7   nihat   19             satış   8000
8   bahri   51             müdür   9000
9   selim   27             müdür  15000

### aggregate

Örnek olarak tüm çalışanları mesleğe göre gruplandırıp yaşa göre minimum, ücrete göre de ortalama değeri gözlemleyelim. Meslek sayısına göre isimlerin sayısından kişi sayısını elde edelim

In [70]:
tum_calisan.groupby('meslek').aggregate({'yas':'min','ücret':'mean','isim':'count'})

                  yas         ücret  isim
meslek
insan kaynakları   41   9000.000000     1
muhasebe           35   8000.000000     1
müdür              27  13000.000000     3
mühendis           23   5166.666667     3
satış              19   6250.000000     2